# SF Löhne Übung - Lösung

Willkommen zurück zu einer kleinen Übungseinheit zur Datenanalyse mit Pandas. Wir werden dafür den [Lohndatensatz von San Francisco](https://www.kaggle.com/kaggle/sf-salaries) nutzen, der auf Kaggle bereitgestellt wird. 

Folgt dem Notebook und bearbeitet die **Aufgabenstellung** der Reihenfolge nach.

**Aufgabe 1:** Importiere pandas als pd.

In [1]:
### CODE HERE ###

In [2]:
### SOLUTION HERE ###
import pandas as pd

In [3]:
### TEST HERE ###
import sys

modulename = "pandas"
if modulename not in sys.modules:
    print("You have not imported the {} module".format(modulename))
else:
    print("You have imported the {} module".format(modulename))

You have imported the pandas module

**Aufgabe 2**: Lese Salaries.csv als Dataframe mit dem Namen `sal` ein. Achte darauf, den richtigen Index zu geben.

**Hinweis:** Die Datei *Salaries.csv* als liegt im diesem Übungungsheft anbei. Wenn du diese von Kaggle herunterlädst, dann muss du die Daten noch etwas anpassen.

In [4]:
### CODE HERE ###

In [5]:
### SOLUTION HERE ###
sal = pd.read_csv("src/Salaries.csv", index_col="Id")

In [6]:
### TEST HERE ###
columns = [
    "EmployeeName",
    "JobTitle",
    "BasePay",
    "OvertimePay",
    "OtherPay",
    "Benefits",
    "TotalPay",
    "TotalPayBenefits",
    "Year",
    "Notes",
    "Agency",
    "Status",
]

if (
    type(sal) == pd.core.frame.DataFrame
    and sal.shape == (148654, 12)
    and set(sal.columns).issubset(set(columns))
):
    print("Test successful")

Test successful

**Aufgabe 3**: Sieh dir den *head* des Dataframe an.

In [7]:
### CODE HERE ###

In [8]:
### SOLUTION HERE ###
sal.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

**Aufgabe 4** Sieh dir die letzten 10 Einträge des Dataframes an.

In [9]:
### CODE HERE ###

In [10]:
### SOLUTION HERE ###
sal.tail(10)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148646,Carolyn A Wilson,Human Services Technician,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148647,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148648,Joann Anderson,Communications Dispatcher 2,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148649,Leon Walker,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

**Aufgabe 5:** Welche Spalten hat das Dataframe? Gib die Spalten in einer Liste wieder und nenne diese `sal_columns`!

In [11]:
### CODE HERE ###

In [12]:
### SOLUTION HERE ###
sal_columns = sal.columns
sal_columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [13]:
### TEST HERE ###
if set(sal_columns).issubset(set(columns)):
    print("Test successful")

Test successful

**Aufgabe 6**: Speicher den Index in der Variable sal_index a

In [14]:
### CODE HERE ###

In [15]:
### SOLUTION HERE ###
sal_index = sal.index
sal_index

Int64Index([     1,      2,      3,      4,      5,      6,      7,      8,
                 9,     10,
            ...
            148645, 148646, 148647, 148648, 148649, 148650, 148651, 148652,
            148653, 148654],
           dtype='int64', name='Id', length=148654)

In [16]:
### TEST HERE ###
import numpy as np

index = np.arange(1, 148655, 1)

if set(sal_index).issubset(set(index)):
    print("Test successful")

Test successful

**Aufgabe 7:** Zeige die *shape* des Dataframes an

In [17]:
### CODE HERE ###

In [18]:
### SOLUTION HERE ###
sal.shape

(148654, 12)

**Aufgabe 8:** Welche Datentypen (dtypes) hat das Dataframe? Speichere diese in `sal_dtypes` ab.

In [19]:
### CODE HERE ###

In [20]:
### SOLUTION HERE ###
sal_dtypes = sal.dtypes
sal_dtypes

EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status              float64
dtype: object

In [21]:
### TEST HERE ###
if list(sal_dtypes)[4] == "float64" and list(sal_dtypes)[10] == "object":
    print("Test successful")

Test successful

**Aufgabe 9**: Nutze die `info()` Methode, um herauszufinden, wie viele Einträge es gibt und ob es vielleicht Dopplungen geben könnte.

In [22]:
### CODE HERE ###

In [23]:
### SOLUTION HERE ###
sal.info()  # 148654 Einträge

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148654 entries, 1 to 148654
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148654 non-null  object
 1   JobTitle          148654 non-null  object
 2   BasePay           148045 non-null  float64
 3   OvertimePay       148650 non-null  float64
 4   OtherPay          148650 non-null  float64
 5   Benefits          112491 non-null  float64
 6   TotalPay          148654 non-null  float64
 7   TotalPayBenefits  148654 non-null  float64
 8   Year              148654 non-null  int64
 9   Notes             0 non-null       float64
 10  Agency            148654 non-null  object
 11  Status            0 non-null       float64
dtypes: float64(8), int64(1), object(3)
memory usage: 14.7+ MB

**Aufgabe 10:** Nutze die `count` Funktion und vergleiche die Ergebnisse pro Spalte mit der `info` methode. Speichere das Ergebnis unter dem Variablennamen `sal_count`.

In [24]:
### CODE HERE ###

In [25]:
### SOLUTION HERE ###
sal_count = sal.count(axis=0)
sal_count

EmployeeName        148654
JobTitle            148654
BasePay             148045
OvertimePay         148650
OtherPay            148650
Benefits            112491
TotalPay            148654
TotalPayBenefits    148654
Year                148654
Notes                    0
Agency              148654
Status                   0
dtype: int64

In [26]:
### TEST HERE ###
if sal_count[5] == 112491 and sal_count[9] == 0:
    print("Test successful")

Test successful

**Aufgabe 10:** Wie viele Zeilen in der Spalte `Benefits` sind NaN-Einträge? Speichere das Ergebnisse in der Variable `sal_nan`.

In [27]:
### CODE HERE ###

In [28]:
### SOLUTION HERE ###
sal_nan = sum(sal["Benefits"].isna())
sal_nan

36163

In [29]:
### TEST HERE ###
if sal_nan == 36163:
    print("Test successful")

Test successful

**Aufgabe 11:** Zeige pro Spalte die wichtigsten Kennzahlen wie count, mean, std, min, Quartile, max in einer Tabelle an.

In [30]:
### CODE HERE ###

In [31]:
### SOLUTION HERE ####
sal.describe()

,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

**Aufgabe 12:** Erstelle eine Tabelle mit allen Spalten in denen das 10%, 25%, 50%, 75%, und 95% Quantile angezeigt wird. Speichere die Tabelle unter `sal_quantile` ab.

In [32]:
### CODE HERE ###

In [33]:
### SOLUTION HERE ###
sal_quantile = sal.quantile([0.1, 0.25, 0.5, 0.75, 0.95])
sal_quantile

,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
0.10,6988.372,0.0000,0.000,200.110,7297.8970,7959.1800,2011.0,NaN,NaN
0.25,33588.200,0.0000,0.000,11535.395,36168.9950,44065.6500,2012.0,NaN,NaN
0.50,65007.450,0.0000,811.270,28628.620,71426.6100,92404.0900,2013.0,NaN,NaN
0.75,94691.050,4658.1750,4236.065,35566.855,105839.1350,132876.4500,2014.0,NaN,NaN
0.95,136223.148,27035.3125,16345.540,46630.425,165790.3025,203566.9545,2014.0,NaN,NaN

In [34]:
### TEST HERE ###
overtime_pay_quantiles = [0.0, 0.0, 0.0, 4658.175, 27035.31249999997]

if set(list(sal_quantile["OvertimePay"].values)).issubset(set(overtime_pay_quantiles)):
    print("Test successful")

Test successful

**Aufgabe 13:** Zeige die Gesamtzahl aller eineindeutigen Werte für alle Spalten an. Speichere das Ergebnis unter `sal_unique`.

In [35]:
### CODE HERE ###

In [36]:
### SOLUTION HERE ###
sal_unique = sal.nunique()
sal_unique

EmployeeName        110811
JobTitle              2159
BasePay             109489
OvertimePay          65998
OtherPay             83225
Benefits             98465
TotalPay            138486
TotalPayBenefits    142098
Year                     4
Notes                    0
Agency                   1
Status                   0
dtype: int64

In [37]:
### TEST HERE ###
unique_values = [110811, 2159, 109489, 65998, 83225, 98465, 138486, 142098, 4, 0, 1, 0]

if set(list(sal_unique.values)).issubset(set(unique_values)):
    print("Test successful")

Test successful

**Aufgabe 14:** Schreibe alle eindeutigen JobTitle in eine Liste mit dem Variablennamen `jobTitles`. Gebe anschließend die ersten 10 Filme JobTitle in aus.

In [38]:
### CODE HERE ###

In [39]:
### SOLUTION HERE ###
jobTitles = sal["JobTitle"].unique().tolist()
jobTitles[:10]

['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
 'CAPTAIN III (POLICE DEPARTMENT)',
 'WIRE ROPE CABLE MAINTENANCE MECHANIC',
 'DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)',
 'ASSISTANT DEPUTY CHIEF II',
 'BATTALION CHIEF, (FIRE DEPARTMENT)',
 'DEPUTY DIRECTOR OF INVESTMENTS',
 'CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
 'ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
 'EXECUTIVE CONTRACT EMPLOYEE']

In [40]:
### TEST HERE ###
title_list = ["DEPUTY DIRECTOR OF INVESTMENTS"]

if title_list == jobTitles[6]:
    print("Test successful")

**Aufgabe 15**: Was sind die fünf häufigsten Jobs? Speichere nur die Jobtitle in einer Liste mit dem Variablennamen `common_jobs`.

In [41]:
### CODE HERE ###

In [42]:
### SOLUTION HERE ###
common_jobs = list(sal["JobTitle"].value_counts().head(5).index)
common_jobs

['Transit Operator',
 'Special Nurse',
 'Registered Nurse',
 'Public Svc Aide-Public Works',
 'Police Officer 3']

In [43]:
### TEST HERE ###
com_j = [
    "Transit Operator",
    "Special Nurse",
    "Registered Nurse",
    "Public Svc Aide-Public Works",
    "Police Officer 3",
]

if set(common_jobs).issubset(set(com_j)):
    print("Test successful")

Test successful

**Aufgabe 16**: Zeige die Anzahl der Null values pro Spalte auf. Speichere die Ergebnisse in Variable `sal_null_count`.

In [44]:
### CODE HERE ###

In [45]:
### SOLUTION HERE ###
sal_null_count = sal.isnull().sum()
sal_null_count

EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [46]:
### TEST HERE ###
if (
    list(
        sal_null_count.iloc[
            2:3,
        ].values
    )[0]
    == 609
    and list(
        sal_null_count.iloc[
            5:6,
        ].values
    )[0]
    == 36163
):
    print("Test successful")

Test successful

**Aufgabe 17**: Suche nach Kim Brewer und zeige die komplette Zeile im Dataframe.

In [47]:
### CODE HERE ###

In [48]:
### SOLUTION HERE ###
sal[sal["EmployeeName"] == "Kim Brewer"]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
60086,Kim Brewer,Parking Control Officer,50818.2,3050.84,1358.3,25964.4,55227.34,81191.74,2012,NaN,San Francisco,NaN
148644,Kim Brewer,Parking Control Officer,0.0,0.00,0.0,0.0,0.00,0.00,2014,NaN,San Francisco,NaN

**Aufgabe 18:** Wie viele Duplikate gibt es beim EmployeeName? Summiere die Ergebnisse und sichere das Endresultat unter der Variable `duplicate_name_sum`.

In [49]:
### CODE HERE ###

In [50]:
### SOLUTION HERE ###
duplicate_name_sum = sum(sal.duplicated(subset="EmployeeName", keep="first"))
duplicate_name_sum

37843

In [51]:
### TEST HERE ###
if duplicate_name_sum == 37843:
    print("Test successful")

Test successful

**Aufgabe 19:** Speicher alle Duplikate in einen neuen Dataframe mit dem Namen `sal_duplicates`. Spiele mit dem Parameter `keep` herum, was fällt dir auf? Nutze dazu gerne wieder die Mitarbeiterin Kim Brewer.

In [52]:
### CODE HERE ###

**`[BEOBACHTUNGEN HERE]`**

In [53]:
### SOLUTION HERE ###
sal_duplicates = sal[sal.duplicated(subset="EmployeeName", keep=False)]  # keep = 'first', 'last', False
sal_duplicates[sal_duplicates["EmployeeName"] == "Kim Brewer"]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
60086,Kim Brewer,Parking Control Officer,50818.2,3050.84,1358.3,25964.4,55227.34,81191.74,2012,NaN,San Francisco,NaN
148644,Kim Brewer,Parking Control Officer,0.0,0.00,0.0,0.0,0.00,0.00,2014,NaN,San Francisco,NaN

**Aufgabe 20** Was ist das durchschnittliche Grundgehalt (en. BasePay)? Speichere das Ergebnis in der Variable `avg_basepay`.

In [54]:
### CODE HERE ###

In [55]:
### SOLUTION HERE ###
avg_basepay = sal["BasePay"].mean()
avg_basepay

66325.4488404877

In [56]:
### TEST HERE ###
if avg_basepay == 66325.44884050643:
    print("Test successful")

**Aufgabe 21:** Was ist der höchste Überstundenlohn (en. OvertimePay), der im Datensatz festgehalten ist? Speichere das Ergebnis in der Variable `max_otpay`.

In [57]:
### CODE HERE ###

In [58]:
### SOLUTION HERE ###
max_otpay = sal["OvertimePay"].max()
max_otpay

245131.88

In [59]:
### TEST HERE ###
if max_otpay == 245131.88:
    print("Test successful")

Test successful

**Aufgabe 22:** Wie lautet die Berufsbezeichnung (en. JobTitle) von JOSEPH DRISCOLL?

*Achtung: Beim Namen nur Großbuchstaben verwenden!*

In [60]:
### SOLUTION HERE ###
sal[sal["EmployeeName"] == "JOSEPH DRISCOLL"]["JobTitle"]

Id
25    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [61]:
### CODE HERE ###

**Aufgabe 23**: Wie viel verdient JOSEPH DRISCOLL (inkl. Zusatleistungen (en. Benefits))?

In [62]:
### SOLUTION HERE ###
sal[sal["EmployeeName"] == "JOSEPH DRISCOLL"]["TotalPayBenefits"]

Id
25    270324.91
Name: TotalPayBenefits, dtype: float64

In [63]:
### CODE HERE ###

**Aufgabe 24:** Wie heißt die höchstbezahlte Person (inkl. Zusatzleistungen)? Speichere den Namen in der Variable `best_pay`.

In [64]:
### CODE HERE ###

In [65]:
### SOLUTION HERE ###
best_pay = sal[sal["TotalPayBenefits"] == sal["TotalPayBenefits"].max()][
    "EmployeeName"
].values[0]
best_pay

'NATHANIEL FORD'

In [66]:
### TEST HERE ###
if best_pay == "NATHANIEL FORD":
    print("Test successful")

Test successful

**Aufgabe 25**: Wie lautet der Name der am niedrigsten bezahlten Person? Fällt dir etwas Merkwürdiges an ihrem Lohn auf?

In [67]:
### CODE HERE ###

**`[BEOBACHTUNGEN HERE]`**

In [68]:
### SOLUTION HERE ###
sal[sal["TotalPayBenefits"] == sal["TotalPayBenefits"].min()]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

**Aufgabe 26:** Wie ist der durchschnittliche (en. mean) Grundlohn (en. base pay) von allen Angestellten pro Jahr (2011-2014)? Speichere das Ergebnis in der Variable `avg_basepay_year`.

In [69]:
### CODE HERE ###

In [70]:
### SOLUTION HERE ###
avg_basepay_year = sal.groupby("Year").mean()["BasePay"]
avg_basepay_year

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [71]:
### TEST HERE ###
if avg_basepay_year.loc[2012] == 65436.40685742262:
    print("Test successful")

Test successful

**Aufgabe 27:** Wie viele Berufsbezeichnungen (en. job titles) wurden 2013 von nur einer Person getragen? Speichere das Ergebnis in `unique_jobs_2013`.

*Hinweis: Haben nur eine Erscheinung in 2013*

In [72]:
### CODE HERE ###

In [73]:
### SOLUTION HERE ###
unique_jobs_2013 = sum(sal[sal["Year"] == 2013]["JobTitle"].value_counts() == 1)
unique_jobs_2013

202

In [74]:
### TEST HERE ###
if unique_jobs_2013 == 202:
    print("Test successful")

Test successful

**Aufgabe 28 (Zusatzaufgabe):** Wie viele Angestellte tragen ein "Chief" in ihrer Berufsbezeichnung? Speichere das Ergebnis in `chef_jobs`.

*Hinweis: Das ist eine etwas schwierigere Aufgabe, nehmt euch etwas Zeit dafür.*

In [75]:
### CODE HERE ###

In [76]:
### SOLUTION HERE ###
def chief_string(title):
    if "chief" in title.lower().split():
        return True
    else:
        return False


chef_jobs = sum(sal["JobTitle"].apply(lambda x: chief_string(x)))
chef_jobs

477

In [77]:
### TEST HERE ###
if chef_jobs == 477:
    print("Test successful")

Test successful

**Aufgabe 29 (Zusatzaufgabe):** Gibt es eine Korrelation zwischen der Länge einer Berufsbezeichnung und dem Lohn?

In [78]:
### CODE HERE ###

In [79]:
### SOLUTION HERE ###
sal["title_len"] = sal["JobTitle"].apply(len)
sal[["title_len", "TotalPayBenefits"]].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

**`[BEOBACHTUNGEN HERE]`**

# Gut gemacht!